{
    "reviews": [
        { "name": "john", "rev": "Interisting Website", "stars": 5 },
        { "name": "ahmed", "rev": "Very usefull for body builders", "stars": 4 },
        { "name": "mohamed", "rev": "Good but need more maintenance", "stars": 3 },
        { "name": "ali", "rev": "Lovely website and very usefull", "stars": 4 },
        { "name": "malak", "rev": "good even for girls", "stars": 4 },
        { "name": "osama", "rev": "can not imagine my life without Fit Hub", "stars": 5 }
    ],




    "products": [
        {"id":1,"name":"Muscle Milk Pro Series Protein Powder, Knockout Chocolate, 50g Protein, 5 Pound", "category":"protein", "price":"85" , "desc":"Contains one 5 lb cannister of Muscle Milk Genuine Protein Powder, packaging may vary. 50 grams of protein per serving to help support muscle rebuilding, muscle growth, and maintenance of muscle mass. Combination of high-quality slow releasing and fast releasing proteins provide a more sustained delivery of protein compared to whey alone." , "img": "https://tse4.mm.bing.net/th?id=OIP.tALWY_t2bRY6kBipr1uZkQHaHa&pid=Api&P=0&h=220"}, 
        {"id":2,"name":"Muscle Milk Pro Series Protein Powder, Intense Vanilla, 50g Protein, 5 Pound", "category":"protein", "price":"80" , "desc":"Contains one 5 lb cannister of Muscle Milk Genuine Protein Powder, packaging may vary. 50 grams of protein per serving to help support muscle rebuilding, muscle growth, and maintenance of muscle mass. Combination of high-quality slow releasing and fast releasing proteins provide a more sustained delivery of protein compared to whey alone." , "img": "https://i5.walmartimages.com/seo/Muscle-Milk-Pro-Series-Protein-Powder-Intense-Vanilla-50g-Protein-5-Pound_94402bf8-63ab-4646-bdd0-cfd70fb27caa.fd457a3577398970c5ae3c8cd4c78086.jpeg?odnHeight=2000&odnWidth=2000&odnBg=FFFFFF"},
        {"id":3,"name":"Muscle Milk Pro Series Protein Powder, Intense Vanilla, 50g Protein, 2 Pound", "category":"protein", "price":"25" , "desc":"50 grams of protein per serving to help support muscle rebuilding, muscle growth, and maintenance of muscle mass.Combination of high-quality slow releasing and fast releasing proteins provide a more sustained delivery of protein compared to whey alone Excellent source of 20 vitamins and minerals. Vitamin D and Calcium for strong bones." , "img": "https://i5.walmartimages.com/seo/Muscle-Milk-Pro-Series-Protein-Powder-Intense-Vanilla-50g-Protein-2-Pound_12080fd0-d527-497f-b9ef-801a48f0d166.88b98f903aaca3eec564789b8d6e9923.jpeg?odnHeight=640&odnWidth=640&odnBg=FFFFFF"},
        {"id":4,"name":"Muscle Milk Zero Protein Powder, Vanilla Creme, 1.65 lbs, 25 Servings, 15g Protein", "category":"protein", "price":"37" , "desc":"Muscle Milk Zero Protein Powder, Vanilla Creme, 1.65 lbs, 25 Servings, 15g Protein: Contains one (1) 1.65 pound canister (about 25 servings) of Muscle Milk Zero Protein Powder. Packaging may vary. Shaker bottle sold separately. HELPS SATISFY HUNGER AND BUILD MUSCLE – Muscle Milk Zero Protein Powder supplies your body with high quality protein to support post-workout recovery " , "img": "https://i5.walmartimages.com/seo/Muscle-Milk-Zero-Protein-Powder-Vanilla-Creme-1-65-lbs-25-Servings-15g-Protein_738ae9bb-8e89-4c38-8991-1a7d7eed3aa9.2dfa0f7857500b842e80a56de15f77e2.jpeg?odnHeight=2000&odnWidth=2000&odnBg=FFFFFF"},
        {"id":5,"name":"Dymatize ISO100 Hydrolyzed Whey Isolate Protein Powder, Dunkin' Cappuccino, 25g Protein, 20 Serv", "category":"protein", "price":"23" , "desc":"20 servings of Dymatize ISO100 Dunkin' Cappuccino Protein Powder 25 grams of protein, 5.5 grams of branched-chain amino acids (BCAAs), and 2.6 grams of Leucine per serving. 1 gram of sugar and fat per serving Scientifically formulated, fast-absorbing, hydrolyzed, 100% whey protein isolate. If your goal is gains in muscle size and strength" , "img": "https://i5.walmartimages.com/seo/Dymatize-ISO100-Hydrolyzed-Whey-Isolate-Protein-Powder-Dunkin-Cappuccino-25g-Protein-20-Serv_9e20a0f0-7a7b-40c1-9486-40788c06ad86.c995874d153d2fa13a459f404de0963d.jpeg?odnHeight=640&odnWidth=640&odnBg=FFFFFF"},
        
        
        {"id":6,"name":"Exercise Bike, Adjustment Magnetic Resistance, Super Silent Belt Drive Indoor Bike for Home Workout, Stationary Bike with 350LBS Weight Capacity, Comfortable Seat Cushion, LCD Monitor", "category":"machines", "price":"280" , "desc":"ULTRA-QUIET BELT DRIVE SYSTE: Unlike deceptive bikes with noisy iron sand flywheels, belt shedding and pulley breakage issues, the exercise bike uses high-strength pulleys, industrial-grade bearings and upgraded magnetic resistance to create an incredibly smooth and nearly silent ride, perfect for indoor workouts. Work, read and sleep at home without interruption.  350 LBS WEIGHT CAPACITY: Constructed with bstainless steel, this exercise bike features an I-shaped base and a triangular body design, equipped with a heavy-duty flywheel, ensuring a safe and stable structure that can support a maximum weight capacity of 350 pounds. MORE SAFE AND STABLE: This Exercise bike use thickened commercial-graded steel pipe which giving this stationary bike a rock solid build. It is for a long-term exercise workout, but not simple products for only a few months' use, 2 horizontal adjustment knobs to keep the bike stable on different surfaces.  100 MIRCO ADJUSTABLE MAGNETIC RESISTANCE: Magnetic resistance with 100 micro-adjustable levels, simply turn the knob to increase or decrease the adjustment to the different levels that best suit you. push the same knob to stop quickly and safely. convenient operation makes the movement more simple and efficient. CUSTOMIZABLE COMFORT: 4-way adjustable wide seat and 2-way adjustable handlebars to accommodate all family members of different heights (Recommended User Height: 5.0 ft - 6.5 ft). The steel toe cage pedals are designed with adjustable straps, which can fit different size feet well. CONSIDERATE PRODUCT DETAILS: Exercise bike comes with a tablet holder, water bottle holder and caged pedals. Extended reach from saddle to handlebar enables space for all sizes of riders. The featured transport wheels allow you to move your stationary bike from indoor to outdoor.  CUSTOMIZED YOUR WORKOUT PLAN: The monitor on our indoor cycling bike can capture your time, spd, dst, cal, odometer, and keep track of your exercise progress in real time. With a tablet holder you can watch exercise class on your Tablet while riding to simulate traveling through France, gravel rides through the Utah backcountry, and even mountain bike rides in New Zealand." , "img": "https://m.media-amazon.com/images/I/71vUPPg933L._AC_UY218_.jpg"},
        {"id":7,"name":"Exercise Bike, Adjustable Magnetic Resistance Brake Stationary Bikes for Home, Quiet Indoor Cycling Bike with Upgraded Seat Cushion, Digital Monitor & Phone Mount, 350lbs Weight Capacity", "category":"machines", "price":"270" , "desc":"【HEAVY-DUTY MATERIAL, STABLE & SAFE】The SLUNSE upgraded home exercise bike features thickened aluminum steel construction with a curved rear base for exceptional durability and stability. Its ergonomic triangular frame design, with 35lbs flywheel, dual 7-shaped brake knobs, and 5pcs adjustable non-slip feet pads provide stabilizing support to ensure firmness and no wobbling on different surface. The max weight capacity is up to 350 lbs, making your workout safer and more reliable.【FULLY ADJUSTABLE, THOUGHTFUL DESIGN】The indoor bike features a 2-way adjustable non-slip handlebar and a 4-way adjustable seat, the height and fore and aft can be freely adjusted, This workout bike suitable for users with height ranges from 4'8'' to 6'4''. The high-rebound soft seat cushion ensures comfort and correct posture during long rides. Aluminum alloy pedals with adjustable straps and nuts at the connections prevent breaking or falling off, making cycling more comfortable and safe.【DATA TRACKING, PROFESSIONAL EXPERIENCE】Exercise bikes with multi-functional LCD monitor can record your time, speed, distance, calorie consumption, and odometer data in detail to help you track your fitness progress in real time, which can help you exercise more scientifically. Adjustable tablet holder and water bottle holder are designed to assist you can watching video lessons to enjoy entertainment and timely hydration, providing a professional and comfortable exercise experience.【MAGNETIC RESISTANCE, QUIET & SMOOTH】Equipped with the latest magnetic resistance system, our stationary bikes for home offers precise adjustments and even stable friction for smoother riding. Unlike traditional wool felt resistance, this magnetic system requires no brake pad replacements and produces no friction noise. Combined with a maintenance-free belt drive controlling the sound at 25dB, more silent during exercise, ideal for home or office use without disturbing others.【MICRO-ADJUSTMENT RESISTANCE, PRECISE CONTROL】Spinning Bike with 100-level micro-adjustment magnetic resistance. The intuitive resistance knob allows precise control of cycling intensity, meeting the training needs of both beginners and advanced users. Smooth and stable resistance brings you together to experience the fun of riding from flat ground to hills, enhancing cardiovascular function and muscle strength. The Emergency brake stops the flywheel immediately, ensuring safe performance." , "img": "https://m.media-amazon.com/images/I/71cNfD3DKRL.__AC_SX300_SY300_QL70_FMwebp_.jpg"},
        {"id":8,"name":"YOSUDA Magnetic/Water Rowing Machine 350 LB Weight Capacity - Foldable Rower for Home Use with Bluetooth, App Supported, Tablet Holder and Comfortable Seat Cushion", "category":"machines", "price":"250" , "desc":"Choose YOSUDA: Design and produce top-quality exercise machines for home use for over 20 years. YOSUDA has been chosed by more than 3,000,000 families and we will always stand behind our product 10× 10 Powerful Magnetic: Equipped with a 10-lb flywheel and high-quality magnetic control system, this rower machine provides enough resistance. All stages users can get an effective workout whether you are a beginner or an advanced user Dual Silent System: The non-contact magnetic resistance system delivers a virtually silent rowing experience. High-density steel reduces noise, changing your daily rowing into pleasure. You can enjoy your workout without worries anytime Well Built & Long Lasting: Commercial quality and the 5mm-thick steel ensures the high durability of YOSUDA rowing machine. Maximum weight capacity can be up to 350 lbs. The 45.2'' long slide fits users from 4'5'' to 6'2'', suitable for family use 6-Types of Data Disply: The 3.45-inch LCD monitor clearly displays the rowing data. You can put the phone or tablet on the holder to enjoy the videos or music" , "img": "https://m.media-amazon.com/images/I/61iVK4slhhL.__AC_SY300_SX300_QL70_FMwebp_.jpg"},
        {"id":9,"name":"FLYBIRD Adjustable Weight Bench with Leg Extension and Curl Machine, Preacher Curl Bench, Foldable Workout Bench for Home Gym, 800LBS Weight Capacity Exercise Bench for Full Body Strength Training", "category":"machines", "price":"160" , "desc":"Sturdy Multifunctional Bench: The FLYBIRD preacher curl bench is crafted from a sturdy and thick steel frame, offers 800 lbs weight capacity and outstanding stability during the entire bench workout; The trapezoid structure further enhances the stability.  Widened Preacher Curl Pad: The 14.6 wide preacher curl pad offers a larger area to exercise your arms effectively; Has 3 angles and 7 heights to better adapt to your body and movement; Can also used to do hyper back extension. Leg Extension and Curl: Leg extension machine helps to exercise leg muscles with 1-in weight storage post; High-resilience columnar foam and 15.6-in extended seat cushion enhance comfort; Collision chock can cushion and provide sufficient room for legs .32.7'' Extended Backrest: The weight bench is suitable for user up to 6'3''; Activate different muscles through 7 back angles, which can be adjusted and locked in 1 step with self-rebounding pin; Lock the leg extension and stabilize legs while do push-ups .Simply Fold to Store: FLYBIRD workout bench can be easily folded by just pulling 2 pins; Is able to stand independently, easier to store the exercise bench; There's a protective pad at the top of the backrest to prevent the cushion from wear and tear. Installation Video and Easy Assembly: We provide an installation video to help you install the adjustable weight bench effortlessly; All the accessories of this preacher curl weight bench are packed in an accessory bag to ensure that all parts are intact" , "img": "https://m.media-amazon.com/images/I/71xK4dDTu6L.__AC_SX300_SY300_QL70_FMwebp_.jpg"},
        {"id":10,"name":"MARCY Pro Smith Cage Workout Machine Full Body Training Home Gym Equipment System with Leg Developer, Press Bar, PEC Deck, and Squat Rack", "category":"machines", "price":"300" , "desc":"Complete Home Gym Solution: Targets multiple muscle groups and provides a full-body workout routine for different fitness levels; Maximum user weight: 300 lbs. Versatile Workout Equipment: All-in-one setup provides multiple workout stations for weight training, squats, bench presses, and more, ideal for both beginners and advanced users.Convenient Space-Saving Design: Designed for home use, this compact gym system maximizes workout potential without taking up too much room, making it perfect for small indoor and outdoor spaces. Heavy-Duty Construction: Built with a durable steel frame, this home gym is designed for long-lasting use. It features safety catches and adjustable positions for enhanced stability during workouts. Product Dimensions and Capacity: Measures 70 inches long, 79 inches wide, and 85 inches tall, offering ample space for various exercise routines; Includes weight plate storage and adjustable components for personalized training" , "img": "https://m.media-amazon.com/images/I/91e1tr8MQSL._AC_SX569_.jpg"},
        {"id":11,"name":"Total Gym APEX Versatile Indoor Home Gym Workout Total Body Strength Training Fitness Equipment", "category":"machines", "price":"140" , "desc":"VARIOUS WORKOUT OPTIONS: Start your at-home workout with 8 resistance levels and over 70 exercises using Total Gym; Enjoy low-impact, fluid movements, effortlessly transitioning between exercises. SPEEDY TRAINING: Sending 15 to 20 minutes, 3 to 4 days a week on your home gym can make a difference; Suitable for all fitness levels, ages 8 to 80, this system supports maximum weight of 300 pounds. TOTAL PHYSIQUE METHOD: Gym station tones, strengthens, and conditions muscles for a total body exercise experience; Assists with body sculpting, weight loss, energy, and more. ACCESSORIES PROVIDED: Includes an instruction manual, DVD, wing attachment, squat stand, leg pull accessory, dip bars, exercise flip chart, and access to Total Gym TV.PRODUCT DETAILS: Glide board on a quality steel frame with auto-lock height adjustment folds easily for storage; When in use, the equipment measures 93 in length, 43.25 tall, and 15.5 wide in inches" , "img": "https://m.media-amazon.com/images/I/61UFH4UmI3L._AC_SX569_.jpg"},
        {"id":12,"name":"Marcy Dual Functioning Body Fitness Workout 150 Pound Stack Home Gym System with Adjustable Preacher Curler Pad and Overhead Lat Station, White/Black", "category":"machines", "price":"1000" , "desc":"REMIUM STEEL CONSTRUCTION – This home gym system is made with heavy-duty steel tubing and reinforced with guard rods that hold weight in place during workouts.. WEIGHT STACK LOCK – This gear comes with a 150-pound selectorized weight stack that can be customized according to your skill level to avoid the stresses of loading and unloading weight plates with a safety lock that prevents unauthorized use of equipment DUAL ACTION PRESS ARMS-Designed with dual action press arms, this versatile equipment allows you to perform chest press and vertical butterfly exercises to develop your biceps, triceps, pectorals, and other muscles with a simple remove/insertion of a pin. REMOVEABLE CURL PAD – This home gym machine features ergonomically designed seats with high-density boxed upholstery to reduce tension and impact. The preacher curl bicep pad is removable and adjustable to allow isolated bicep exercises.. CONVENIENT HOME GYM- enjoy efficient training right in the comfort of home with this equipment featuring an innovative structure that combines arm and leg stations; great for strengthening muscle groups and achieving a comprehensive total-body workout.. Assembled Dimensions: 68”L x 42”W x 78”H || Maximum Weight Capacity: 300lb. Burn calories and increase lean muscle mass. Resistance training not only builds lean and powerful muscles, it also increases your metabolic rate, allowing you to burn more calories and lose unwanted weight." , "img": "https://m.media-amazon.com/images/I/71E3caZAXOL._AC_SL1500_.jpg"},
        {"id":13,"name":"Signature Fitness Cable Crossover Machine for Weight Lifting and Bodybuilding", "category":"machines", "price":"580" , "desc":"High Quality - Cable Crossover Machine is made of high quality steel and pulley system. It comes with 2 premium handles for your convenience. Large Capacity - The weight plate holder fits any 2-inch Olympic iron plates and bumper plates. The plate holders measure 9 inches each. 1000 lbs overall weight capacity. Great for Home Gym - Machine measures 102 inches wide at 79 inches high. It's an excellent addition to your home gym. Versatility - This equipment offers a wide variety of balance improving, coordination enhancing workouts for your home gym. Improve resistance and target your abs, biceps, triceps, and pectorals with this versatile machine.  Machine ONLY, weight plates not included" , "img": "https://m.media-amazon.com/images/I/71GtJ-T7kKL._AC_SX569_.jpg"},
     
        {"id":14,"name":"Amazon Basics Neoprene Dumbbell Hand Weights", "category":"dumbles", "price":"24" , "desc":"12 pound dumbbell (set of 2) for exercise and strength training. Neoprene coating in Black offers long lasting durability. Hexagon shaped ends prevent dumbbells from rolling away and offer stay-in-place storage. Nonslip grip promotes a comfortable, secure hold.   Available in multiple sizes to mix and match for specific workout needs and to expand on over time.  Printed weight number on each end cap and color coded for quick identification" , "img": "https://m.media-amazon.com/images/I/71x4J8T52KL.__AC_SY300_SX300_QL70_FMwebp_.jpg"},
        {"id":15,"name":"RitFit 5-300LBS Rubber Encased Hex Dumbbell Sets with Optional Rack for Home Gym, Coated Hand Weights for Strength Training, Workouts", "category":"dumbles", "price":"28" , "desc":"【Package Included】: Contains 2 X 5 LB dumbbells. You can also choose other combos to vary the intensity of your workouts from any fitness routine to functional training.【Superior Quality Material】: The 2 X 5LB Free Weights made of solid cast-iron core for reliable strength; will not bend or break after repeated use. The coated hand weights is also extremely durable and odor-free.【Ergonomical Handle Design】: Knurled handle provides essential grip and security during use. The special hexagon shape prevents rolling; Contoured, textured, chrome handle for a comfortable and secured grip.【Ultimate Full-Body Dumbbell】: Build muscle, gain strength and get ripped with RitFit ultimate dumbbell, perfect for building muscles in arms, shoulders and back." , "img": "https://m.media-amazon.com/images/I/61t4c5zYVAL.__AC_SX300_SY300_QL70_FMwebp_.jpg"},
        {"id":16,"name":"CAP Barbell Coated Hex Dumbbell Weight | Multiple Options", "category":"dumbles", "price":"59" , "desc":"FEATURES – NEW EDITION with robust packaging to ensure great condition. Each dumbbell features hex-shaped heads to prevent rolling; Medium-depth knurling on the ergo handle provides essential grip and security during use; Coating is extremely durable CHOICES – Includes ONE 50 lb dumbbell; Each dumbbell is sold individually; Sizes range from 10-50 lbs.. VERSATILE – Adding a dumbbell or two to your workout routine offers many benefits such as burning more calories and building muscle; Dumbbells can be used for essentially any fitness routine and muscle group.. CONSTRUCTION – Each dumbbell head is made from ASTM A48 Class 20 grey iron joined together by a solid 1018 cold rolled steel chromed handle for exceptional durability and longevity.  FUNCTIONAL – Great for building and toning muscle, losing fat, burning calories, better balance, enhanced mood and more. Can be used for all major muscle groups such as abs, core, arms, and legs" , "img": "https://m.media-amazon.com/images/I/814xUYK0WiL.__AC_SX300_SY300_QL70_FMwebp_.jpg"},
        {"id":17,"name":"CAP Barbell 2-Inch Olympic Grip Weight Plate | Multiple Options", "category":"dumbles", "price":"21" , "desc":"INCLUDES - SIX 2.5 LB Olympic Grip plates. CONSTRUCTION – Made of solid cast iron with a machined hole and a durable black baked enamel finish; The weight has a 2-inch center hole to accommodate Olympic bars; E-commerge packaging.  FEATURES – Each weight features grip holes to provide a secure grip during use; The baked enamel coating ensures a durable, reliable weight that will last through grueling workouts & the raised numbers help to easily identify weight sizes.   VERSATILE – Weight plates can be used to perform muscle strengthening exercises and endurance training, and to increase flexibility and balance; A single weight plate can also be used for warm-up exercises" , "img": "https://m.media-amazon.com/images/I/91wXt8kmq0L._AC_SX569_.jpg"},
        {"id":18,"name":"Black Change Weight Plates 1.25LB 2.5LB 5LB Set Fractional Plate Olympic Bumper Plates for Cross Training Bumper Weight Plates Steel Insert Strength Training Weight Plates", "category":"dumbles", "price":"45" , "desc":"RUBBER COATED CHANGE PLATES： EVERYMATE change plates are made of steel core which can add stability to bumper weight plates. We select high-quality rubber as a coating to create stronger and more durable change plates. Bumper change plates are easier to handle than traditional iron plates. The high-quality rubber of change plates prevents your floor from scratching. Corrosion-resistant, no peculiar smell. Don't worry about the smell of rubber in the fitness area at home" , "img": "https://m.media-amazon.com/images/I/716ez+gem3L._AC_SX569_.jpg"},
        {"id":19,"name":"Yaheetech Barbell Weight Set - Olympic Curl Bar & 6 Olympic Weights & 2 Olympic Barbell Clamps for Lifts 66LB/55LB/44LB", "category":"dumbles", "price":"60" , "desc":"Secure and Comfortable Grip: This detachable bar is designed in the shape of a W to provide a comfortable and secure grip. The hand-holding section has an anti-skid knurled grip to avoid sliding caused by perspiration. Ergonomic Curl Bar: The curved bar of this barbell set reduces wrist pressure and enhances comfort by aligning with your natural grip, lowering the risk of accidents during intense workouts. Star Locks for Enhanced Safety: The weightlifting barbell set includes two star lock collars to secure the weight plates in place, ensuring stability and preventing plates from falling or slipping during exercise. Versatile Use: Made of solid nickel-plated iron, this curl bar with plates supports muscular development and strength training, suitable for seasoned bodybuilders and beginners. Ideal for home gyms, health clubs, studios, and fitness facilities.Fit for All Levels: This weight-lifting bar set accommodates various strength and aerobic exercises, catering to beginners, fitness enthusiasts, and professional trainers at any stage of their fitness journey" , "img": "https://m.media-amazon.com/images/I/71YsxxCykIL._AC_SX569_.jpg"},
        
        {"id":20,"name":"LAT Pull Down Bars Cable Machine Attachments, Rowing T-bar V-bar Set, Ergonomic Back Strength Training Handle Grips, for Cable Machine Rowing Machine Home Gym Equipment (Heavy Duty Pack of 5)", "category":"equipments", "price":"119" , "desc":"Multiple Purpose: Easily attach to your home or gym fitness equipments like LAT machine, cable machine, rowing machine, smith machine, power cage. With the aid of above equipments, you can fully train back muscle group, this is meaningful upgrade for your back work out equipment.  Fully Body Building: With the help of different size V-bars & rowing bars, you can train most of back muscle groups: Latissimus Dorsi, Rhomboids, Teres Major, Teres Minor, InfraspinatusComfortable Grip: Ergonomic hand-grips, surface dipping plastic rubber treatment. Compared with normal fitness equipments, which is easier to hold without hurting your hands, they are more effective pulldown bars.  Durable Mag Grip: High quality solid steel V bar set, withstand traction up to 880 lbs. By surface dipping plastic treatment, Obtain stronger anti-rust ability and extremely long service life to accompany your gym cable pulley system.   Training Equipment Kit: Contains 5 different lat bars, compared with ordinary V-bar, D-handle, it can train back muscles as fully as possible, you don't need to take time to collect required lat pulldown attachments, like alone mag bar or handle.  Reinforced Packaging: In order to better protect these grips, we use high High strength corrugated box, Polyethylene foam cushioning sponge lining for packaging.  Easy Use: To make it easier to use these mag bars and to reduce wear and tear on the surface, we've added 5 carabiners, and you'll be able to assemble these mag bars on smith machine more easily." , "img": "https://m.media-amazon.com/images/I/71wQPTzuAjL._AC_SX569_.jpg"},
        {"id":21,"name":"Tricep Press Down Cable Machine Attachment, Made of Heavy Duty Solid Steel, LAT Pulldown Attachments, Home Gym Accessories, Double D Handle, V Bar, Tricep Rope, Pull Down Bar", "category":"equipments", "price":"55" , "desc":"Combo includes: 1x V-Handle (Double D Handle), 1x V-Shaped Bar, 1x Straight Rotating Bar, 1x Press Down Tricep Rope, 4x Snap Hooks. These home gym accessories for men and women are designed to fit most cable systems. V Handle with Rotation (Double D Handle) - Constructed of high-quality solid steel with polished chrome finish.Textured rubber coating handle,provides ergonomic & secured grip during workout, provides a balanced force to both arms when attach it to any gym machine. Rotating Steel Straight Bar: 18-inch length and 1-inch diameter, 360-degree swivel with chrome polished finish and textured handles to prevent from corrosion, rust and endure ,Weight Capacity: Up to 800 lbs.Ideal for performing pull downs,triceps press downs, upright rows,straight bar curls, seated rows, etc. V Shape Bar with Flat Knobs - Constructed of solid steel for more durability & shiny chrome finish for corrosion prevention; the rubber on handles provides a firm, non-slip grip while the flat knob ends keep your hands in place. Nylon Braided Tricep Rope - made of heavy-duty black nylon braided rope with solid rubber ends and chrome plated swivel attachment provides fluently rotating movement. Weight Capacity: Up to 600 lbs." , "img": "https://m.media-amazon.com/images/I/71OujCyprCS.__AC_SX300_SY300_QL70_FMwebp_.jpg"},
        {"id":22,"name":"Clout Fitness Olympic Barbell Clamps Collars Quick Release Pair of Locking Weight Clips Fit 2 Inch Barbell for Weightlifting", "category":"equipments", "price":"19" , "desc":"Quickly change weights: The quick release lever makes it quick and easy to swap out weights. Fits 2-inch weight bars: The clamps have a 2-inch diameter and fit a 2-inch barbell or hex bar. Sold in pairs: Each unit you buy contains a duo of barbell clamps" , "img": "https://m.media-amazon.com/images/I/61EOg1hmbJL.__AC_SX300_SY300_QL70_FMwebp_.jpg"},
        {"id":23,"name":"Marcy Weightlifting Accessory Spring Clip Collars for Weight Bar and Dumbbell Handles, Sold in Pair", "category":"equipments", "price":"9" , "desc":"QUALITY STEEL CONSTRUCTION – This home gym is made with premium quality-steel construction designed to deliver a sturdy and tight hold for your weight bars. It features a simple, chromed metallic design that makes for high functionality and durability. FITS 2” WEIGHT BARS – This bar spring clips are structured to fit your 2” Olympic weight barbells, giving you a smooth flow of workout that helps you handle your weights with firmness and stability and lessens the chance of accidents during weightlifting. SAFE AND SECURE GRIP –The grip of these Olympic weight bar spring collars is strong enough to hold heavier weights for a more efficient workout routine. Just carefully open the wire by squeezing the handles and the collars will smoothly slide onto the bar." , "img": "https://m.media-amazon.com/images/I/710WRn6-whL.__AC_SX300_SY300_QL70_FMwebp_.jpg"},
        {"id":24,"name":"Marcy Olympic Weight Plate Tree for 2-Inch Plates Weight Storage Rack", "category":"equipments", "price":"59" , "desc":"HEAVY-DUTY GYM ORGANIZER: Keep your lifting area organized with this A-frame weight stand designed for Olympic-sized weight plates with 2-inch diameter holes and an Olympic weight bar. Its sturdy frame can withstand a weight of up to 300 pounds. DURABLE STEEL CONSTRUCTION: Manufactured from high-quality steel, this handy organizer features a premium construction that effectively resists scratches and chipping, ing this reliable equipment that will last a long time in your home gym. SECURE WEIGHT COLLARS: This versatile rack comes with collars to secure the weights on each peg, preventing each from accidentally detaching and dropping to the floor. The posts and weight collars are designed to hold the heaviest plate firmly." , "img": "https://m.media-amazon.com/images/I/61m+6rfYnDL._AC_SY300_SX300_.jpg"},
        {"id":25,"name":"ProSource Tri-Fold Folding Thick Exercise Mat 6’x2’ with Carrying Handles for MMA, Gymnastics, Stretching, Core Workouts", "category":"equipments", "price":"39" , "desc":"EASY TO CARRY - Tri-fold design is compact for storage with two carrying handles for fitness anywhere. THICK CUSHION - Provides a supportive surface for gymnastics, workouts, stretching, martial arts or outdoor workout routines. JOINT PROTECTION - Resilient foam interior keeps its shape for long-term usability & protects knees, wrists, elbows & back. URABLE - Easy to clean vinyl surface that opens to 724 l * w 24W x 1 1/2T resists tearing or stretching" , "img": "https://m.media-amazon.com/images/I/71VcleXSlUL.__AC_SX300_SY300_QL70_FMwebp_.jpg"}
       
        
    ]
}